# --------------------------------------------------------------------
# ある正の整数Nに対し，N以下の素因数が2種類の数の最大をA[N]と書く。
# 例：A[6]=6, A[7]=6, A[8]=6, A[9]=6, A[10]=10
# <- 各iについてA[i]の素因数が2種類なら更新してけばよい
# そうすれば、各クエリのNに対してA[isqrt(N)]が答えとなるから上を全列挙したい
# たとえば、A=[{},{},{2},{},{}...]
# ってやって、エラトステネスの篩と同じ要領でsetに加えていくとかが考えられる。
# --------------------------------------------------------------------

from math import isqrt

P = [set() for _ in range(1000002)]
for p in range(2,1000002):
    if P[p]:
        continue
    for i in range(p,1000002,p):
        P[i].add(p)

P[6] = 6
for i in range(7,1000002):
    if len(P[i]) != 2:
        P[i] = P[i-1]
    else:
        P[i] = i

Q = int(input())
for _ in range(Q):
    A = int(input())
    print(P[isqrt(A)]**2)